# x= 'abcd'
# if x == 'abc' :
#     print('x的值和abc相等')
# else:
#     print('x的值和abc不相等')

#练习一 条件语句的使用
#使用if语句判断字符串的长度是否等于10，根据判断结果进行不同的输出
# a = '12345'
# if len(a) == 10:
#     print('a的长度等于10')
# else:
#     print('a的长度不等于10')

#提示用户输入一个1-40之间的数字，使用if语句根据输入数字的大小进行判断，如果输入的数字在 1-10，11-20，21-30，31-40，分别进行不同的输出
# s = int(input('请输入1~40之间的数字'))
# if s >= 1 and s <= 10 :
#     print('您输入的数字在1-10之间')
# if s >= 11 and s <= 20:
#     print('您输入的数字在11-20之间')
# if s >= 21 and s <= 30:
#     print('您输入的数字在21-30之间')
# if s >= 31 and s <= 40:
#     print('您输入的数字在31-40之间')

#练习二 循环语句的使用
#使用for语句输出1-100之间的所有偶数
# for i in range(0,100):
#     if i % 2 ==0:
#         print(i)

#使用while语句输出1-100之间能够被3整除的数字
# i = 0
# while i <= 100 :
#     if i % 3 == 0 :
#         print(i)
#     i += 1


